




























{"id":770807290,"title":"The Spy Next Door","year":2010,"genres":["Action & Adventure","Comedy"],"mpaa_rating":"PG","runtime":94,"critics_consensus":"","release_dates":{"theater":"2010-01-15","dvd":"2010-05-18"},"ratings":{"critics_rating":"Rotten","critics_score":12,"audience_rating":"Spilled","audience_score":40},"synopsis":"Reminiscent of Kindergarten Cop, with a dash of Spy Kids, The Spy Next Door blends together an entertaining mixture of family fun and martial-arts comedy styling to form a familiar story that once again reminds us that even hardened action heroes have a soft side. Jackie Chan stars as Bob Ho, an international spy on loan to the CIA who gives up his job in hopes of leading a so-called normal life with his next-door-neighbor girlfriend and her rambunctious brood. There's nothing in Spy that the audience hasn't seen before from similarly themed incarnations (think The Pacifier), but, fans will appreciate director Brian Levant's homage to Jackie Chan's past Hong Kong movie blockbusters -- most notably, Police Story and The Legend of Drunken Master -- during the opening credit sequence, which is fitting considering many of the action sequences are derivative of those films.The main story centers on Bob's relationship with artsy single mom Gillian (Amber Valletta) and her three kids: precocious teenage stepdaughter Farren (Madeline Carroll), nerdy middle child Ian (Will Shadley), and adorably energetic Nora (Alina Foley). After an emergency sends Gillian away to Denver, Bob steps up and offers to watch the kids while she's gone. Ill-equipped to handle a situation that's clearly over his head, Bob utilizes his spy skills and gadgets -- video watch, GPS tracking, x-ray glasses -- to gain control over the situation in hopes of winning over the kid's affection, but when an old enemy escapes from prison and threatens his potential family, Bob must return to his 007 world of international espionage to protect them.Admittedly, there's a certain level of cheese in this film, especially when it comes to the Boris-and-Natasha-style villains, Poldark (Magnus Scheving) and Creel (Katherine Boecher), whose silly Russian stereotyped performances and running joke about American fashion unabashedly border on cringe-worthy territory. Not to mention, the thinly plotted storyline involving brainiac Ian, who accidentally downloads a top-secret formula for oil-eating ooze created by the bad guys, which propels the main action of the film. Adding to the pile are the supporting cast members: George Lopez as the traitorous CIA agent, Glaze, and Billy Ray Cyrus as CIA agent and Bob's BFF Colton James, who lends folksy witticisms like \"As gone as rum cake at an AA meeting.\"Even so, Chan's charm wins out in the end, and The Spy Next Door's most effective sequences involve Bob's attempts to bond with the kids -- from taking little Nora shopping for a Halloween costume to helping Ian with school bullies and girls. These comedic moments more or less overshadow an otherwise simplistic narrative, and the audience can't help but smile to themselves every time Chan appears onscreen. Die-hard fans might miss the era of classic kick-ass Hong Kong action films, but Spy manages to fill that void as an entertaining alternative that kids and parents alike will enjoy. ~ Alaina O'Connor, Rovi","posters":{"thumbnail":"http://resizing.flixster.com/iMfJNK01_Y_QAgpOeYdOpSJQGwM=/54x81/dkpu1ddg7pbsk.cloudfront.net/movie/11/17/80/11178004_ori.jpg","profile":"http://resizing.flixster.com/iMfJNK01_Y_QAgpOeYdOpSJQGwM=/54x81/dkpu1ddg7pbsk.cloudfront.net/movie/11/17/80/11178004_ori.jpg","detailed":"http://resizing.flixster.com/iMfJNK01_Y_QAgpOeYdOpSJQGwM=/54x81/dkpu1ddg7pbsk.cloudfront.net/movie/11/17/80/11178004_ori.jpg","original":"http://resizing.flixster.com/iMfJNK01_Y_QAgpOeYdOpSJQGwM=/54x81/dkpu1ddg7pbsk.cloudfront.net/movie/11/17/80/11178004_ori.jpg"},"abridged_cast":[{"name":"Jackie Chan","id":"162661013","characters":["Bob Ho"]},{"name":"Amber Valletta","id":"162653722","characters":["Gillian"]},{"name":"Madeline Carroll","id":"770753814","characters":["Farren"]},{"name":"Will Shadley","id":"770821691","characters":["Ian"]},{"name":"Alina Foley","id":"770814918","characters":["Nora"]}],"abridged_directors":[{"name":"Brian Levant"}],"studio":"Lionsgate","alternate_ids":{"imdb":"1273678"},"links":{"self":"http://api.rottentomatoes.com/api/public/v1.0/movie_alias.json?type=imdb&id=1273678","alternate":"http://www.rottentomatoes.com/m/spy_next_door/","cast":"http://api.rottentomatoes.com/api/public/v1.0/movies/770807290/cast.json","reviews":"http://api.rottentomatoes.com/api/public/v1.0/movies/770807290/reviews.json","similar":"http://api.rottentomatoes.com/api/public/v1.0/movies/770807290/similar.json","canonical":"http://api.rottentomatoes.com/api/public/v1.0/movies/770807290.json"},"link_template":"http://api.rottentomatoes.com/api/public/v1.0/movie_alias.json?type=imdb&id={alias-id}"}
