




























{"id":770815529,"title":"The Eagle","year":2011,"genres":["Drama","Action & Adventure","Classics"],"mpaa_rating":"PG-13","runtime":114,"critics_consensus":"","release_dates":{"theater":"2011-02-11","dvd":"2011-06-21"},"ratings":{"critics_rating":"Rotten","critics_score":39,"audience_rating":"Spilled","audience_score":41},"synopsis":"In 2nd-Century Britain, two men - master and slave - venture beyond the edge of the known world on a dangerous and obsessive quest that will push them beyond the boundaries of loyalty and betrayal, friendship and hatred, deceit and heroism...The Roman epic adventure The Eagle is directed by Kevin Macdonald and produced by Duncan Kenworthy. Jeremy Brock has adapted the scr eenplay from Rosemary Sutcliff's classic novel The Eagle of the Ninth. In 140 AD, the Roman Empire extends all the way to Britain - though its grasp is incomplete, as the rebellious tribes of Caledonia (today's Scotland) hold sway in the far North. Marcus Aquila (Channing Tatum) arrives in Britain, determined to restore the tarnished reputation of his father, Flavius Aquila. It was 20 years earlier that Rome's 5,000-strong Ninth Legion, under the command of Flavius and carrying their golden emblem, the Eagle of the Ninth, marched north into Caledonia. They never returned; Legion and Eagle simply vanished into the mists. Angered, the Roman Emperor Hadrian ordered the building of a wall to seal off the territory; Hadrian's Wall became the northernmost frontier of the Roman Empire - the edge of the known world. Driven to become a brilliant soldier and now given command of a small fort in the southwest, Marcus bravely leads his troops during a siege. Commended by Rome for his bravery, yet discharged from the army because of his severe wounds, Marcus convalesces, demoralized, in the villa of his Uncle Aquila (Donald Sutherland), a retired army man. When Marcus impulsively gets a young Briton's life spared at a gladiatorial contest, Aquila buys the Briton, Esca (Jamie Bell), to be Marcus' slave. Marcus is dismissive of Esca, who harbors a seething hatred of all things Roman. Yet Esca vows to serve the man who has saved his life. Hearing a rumor that the Eagle has been seen in a tribal temple in the far north, Marcus is galvanized into action, and sets off with Esca across Hadrian's Wall. But the highlands of Caledonia are a vast and savage wilderness, and Marcus must rely on his slave to navigate the region. When they encounter ex-Roman soldier Guern (Mark Strong), Marcus realizes that the mystery of his father's disappearance may well be linked to the secret of his own slave's identity and loyalty - a secret all the more pressing when the two come face-to-face with the warriors of the fearsome Seal Prince (Tahar Rahim). A Focus Features presentation in association with Film4 of a Duncan Kenworthy production. Channing Tatum, Jamie Bell. The Eagle. Donald Sutherland, Mark Strong. Casting by Jina Jay. Music by Atli Orvarsson. Costumes by Michael O'Connor. Editor, Justine Wright. Production Designer, Michael Carlin. Director of Photography, Anthony Dod Mantle, BSC, DFF. Co-Producer, Caroline Hewitt. Executive Producers, Tessa Ross, Miles Ketley, Charles Moore. Based on the novel The Eagle of the Ninth by Rosemary Sutcliff. Screenplay by Jeremy Brock. Produced by Duncan Kenworthy. Directed by Kevin Macdonald. A Focus Features Release.-- (C) Focus Features","posters":{"thumbnail":"http://content9.flixster.com/movie/11/15/43/11154303_tmb.jpg","profile":"http://content9.flixster.com/movie/11/15/43/11154303_tmb.jpg","detailed":"http://content9.flixster.com/movie/11/15/43/11154303_tmb.jpg","original":"http://content9.flixster.com/movie/11/15/43/11154303_tmb.jpg"},"abridged_cast":[{"name":"Channing Tatum","id":"162661835","characters":["Marcus Aquila"]},{"name":"Jamie Bell","id":"162653082","characters":["Esca"]},{"name":"Mark Strong (II)","id":"478055173","characters":["Guern"]},{"name":"Tahar Rahim","id":"770839336","characters":["Seal Prince"]},{"name":"Donald Sutherland","id":"162655293","characters":["Uncle Aquila"]}],"abridged_directors":[{"name":"Kevin Macdonald"}],"studio":"Focus Features","alternate_ids":{"imdb":"1034389"},"links":{"self":"http://api.rottentomatoes.com/api/public/v1.0/movie_alias.json?type=imdb&id=1034389","alternate":"http://www.rottentomatoes.com/m/the-eagle-of-the-ninth/","cast":"http://api.rottentomatoes.com/api/public/v1.0/movies/770815529/cast.json","reviews":"http://api.rottentomatoes.com/api/public/v1.0/movies/770815529/reviews.json","similar":"http://api.rottentomatoes.com/api/public/v1.0/movies/770815529/similar.json","canonical":"http://api.rottentomatoes.com/api/public/v1.0/movies/770815529.json"},"link_template":"http://api.rottentomatoes.com/api/public/v1.0/movie_alias.json?type=imdb&id={alias-id}"}
